mixly/SMeshStudio/mcore/hw/mbed/boards.txt
mbed_xdow_lpc11u35_gcc_arm.build.architecture=arm-none-eabi
mbed_xdow_lpc11u35_gcc_arm.build.command.as=arm-none-eabi-as
mbed_xdow_lpc11u35_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_xdow_lpc11u35_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_xdow_lpc11u35_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_xdow_lpc11u35_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_xdow_lpc11u35_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_xdow_lpc11u35_gcc_arm.build.command.size=arm-none-eabi-size

mbed_xdow_lpc11u35_gcc_arm.build.core=mbed
mbed_xdow_lpc11u35_gcc_arm.build.variant=mbed_xdow_lpc11u35_gcc_arm

mbed_xdow_lpc11u35_gcc_arm.build.CC_FLAGS=-mcpu=cortex-m0 -mthumb -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections -fomit-frame-pointer -DNDEBUG  -Os  -Wno-unused-function -Wno-unused-variable
mbed_xdow_lpc11u35_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_xdow_lpc11u35_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98  -fno-rtti
mbed_xdow_lpc11u35_gcc_arm.build.CC_SYMBOLS = -DTARGET_LPC11U35 -DTARGET_M0 -DTARGET_NXP -DTARGET_LPC11UXX -DTARGET_LPC11U35_401 -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M0 -DARM_MATH_CM0 -DMBED_BUILD_TIMESTAMP=1415006910.97 -D__MBED__=1 
mbed_xdow_lpc11u35_gcc_arm.build.LD_FLAGS = -mcpu=cortex-m0 -mthumb -Wl,--gc-sections --specs=nano.specs
mbed_xdow_lpc11u35_gcc_arm.build.LD_SYS_LIBS =-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys

mbed_xdow_lpc11u35_gcc_arm.build.ldscript=hw/mbed/variants/mbed_xdow_lpc11u35_gcc_arm/cmsis/TARGET_NXP/TARGET_LPC11UXX/TOOLCHAIN_GCC_ARM/TARGET_LPC11U35_401/LPC11U35.ld

mbed_xdow_lpc11u35_gcc_arm.build.use_archiver=false
mbed_xdow_lpc11u35_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_xdow_lpc11u35_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_xdow_lpc11u35_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_xdow_lpc11u35_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_xdow_lpc11u35_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_xdow_lpc11u35_gcc_arm/cmsis/TARGET_NXP/TARGET_LPC11UXX/TOOLCHAIN_GCC_ARM/TARGET_LPC11U35_401" {build.LD_SYS_LIBS}
mbed_xdow_lpc11u35_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin" 
#& "{runtime.ide.path}/tools/fix_checksum.exe" "{build.path}/{build.project_name}.bin"
mbed_xdow_lpc11u35_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_xdow_lpc11u35_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"

###################################################################################################################
mbed_arch_max_f407vg_gcc_arm.name= Seeed Arch Max mbed STM32F407VG make by gcc_arm and upload by copy
mbed_arch_max_f407vg_gcc_arm.upload.protocol=copy
mbed_arch_max_f407vg_gcc_arm.upload.tool=mbed_cp
mbed_arch_max_f407vg_gcc_arm.build.mcu=cortex-m4
mbed_arch_max_f407vg_gcc_arm.build.cpu=STM32f411RE

mbed_arch_max_f407vg_gcc_arm.build.architecture=arm-none-eabi
mbed_arch_max_f407vg_gcc_arm.build.command.as=arm-none-eabi-as
mbed_arch_max_f407vg_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_arch_max_f407vg_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_arch_max_f407vg_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_arch_max_f407vg_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_arch_max_f407vg_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_arch_max_f407vg_gcc_arm.build.command.size=arm-none-eabi-size

mbed_arch_max_f407vg_gcc_arm.build.core=mbed
mbed_arch_max_f407vg_gcc_arm.build.variant=mbed_arch_max_stm32f407_gcc_arm

mbed_arch_max_f407vg_gcc_arm.build.CC_FLAGS=  -mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=softfp -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections  -Wno-unused-function -Wno-unused-variable -MMD -MP
mbed_arch_max_f407vg_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_arch_max_f407vg_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_arch_max_f407vg_gcc_arm.build.CC_SYMBOLS =-DTARGET_ARCH_MAX -DTARGET_M4 -DTARGET_STM -DTARGET_STM32F4 -DTARGET_STM32F407 -DTARGET_STM32F407VG -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M4 -DARM_MATH_CM4 -D__FPU_PRESENT=1 -DMBED_BUILD_TIMESTAMP=1415017619.95 -D__MBED__=1 
 
mbed_arch_max_f407vg_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=softfp -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float -Wl,-Map={build.project_name}.map,--cref
mbed_arch_max_f407vg_gcc_arm.build.LD_SYS_LIBS =   -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys

mbed_arch_max_f407vg_gcc_arm.build.ldscript=hw/mbed/variants/mbed_arch_max_stm32f407_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F4/TARGET_STM32F407VG/TOOLCHAIN_GCC_ARM/STM32F407XG.ld

mbed_arch_max_f407vg_gcc_arm.build.use_archiver=false
mbed_arch_max_f407vg_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_arch_max_f407vg_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_arch_max_f407vg_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_arch_max_f407vg_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_arch_max_f407vg_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_arch_max_f407vg_gcc_arm/cmsis/mbed_arch_max_stm32f407_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F407VG/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_arch_max_f407vg_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_arch_max_f407vg_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_arch_max_f407vg_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"

