mixly/SMeshStudio/mcore/hw/mbed/boards.txt
mbed_f446re_gcc_arm.build.architecture=arm-none-eabi
mbed_f446re_gcc_arm.build.command.as=arm-none-eabi-as
mbed_f446re_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_f446re_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_f446re_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_f446re_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_f446re_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_f446re_gcc_arm.build.command.size=arm-none-eabi-size

mbed_f446re_gcc_arm.build.core=mbed
mbed_f446re_gcc_arm.build.variant=mbed_f446re_gcc_arm

mbed_f446re_gcc_arm.build.CC_FLAGS= -mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=hard -c -g -fno-common -fmessage-length=0 -Wall -Wextra -fno-exceptions -ffunction-sections -fdata-sections -fomit-frame-pointer -MMD -MP -DNDEBUG -Os
mbed_f446re_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_f446re_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_f446re_gcc_arm.build.CC_SYMBOLS= -DTARGET_M4 -DTARGET_FF_ARDUINO -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -DTARGET_FF_MORPHO -DTARGET_CORTEX_M -D__FPU_PRESENT=1 -DTARGET_STM32F446RE -DMBED_BUILD_TIMESTAMP=1448614999.29 -DTARGET_NUCLEO_F446RE -D__MBED__=1 -DTARGET_STM -DTARGET_STM32F4 -D__CORTEX_M4 -DARM_MATH_CM4 
mbed_f446re_gcc_arm.build.LD_FLAGS =-mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=hard -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float -Wl,--wrap,main -Wl,-Map={build.project_name}.map,--cref
mbed_f446re_gcc_arm.build.LD_SYS_LIBS =-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys

mbed_f446re_gcc_arm.build.ldscript=hw/mbed/variants/mbed_f446re_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F4/TARGET_NUCLEO_f446RE/TOOLCHAIN_GCC_ARM/STM32F446XE.ld

mbed_f446re_gcc_arm.build.use_archiver=false
mbed_f446re_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f446re_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f446re_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_f446re_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_f446re_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_f446re_gcc_arm/cmsis/TARGET_STM/TARGET_NUCLEO_f446re/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_f446re_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_f446re_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_f446re_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
###################################################################################################################
mbed_f334r8_gcc_arm.name=ST Nucleo F334R8 mbed boards  by gcc_arm and upload by copy
mbed_f334r8_gcc_arm.upload.protocol=copy
mbed_f334r8_gcc_arm.upload.tool=mbed_cp
mbed_f334r8_gcc_arm.build.mcu=cortex-m4
mbed_f334r8_gcc_arm.build.cpu=STM32F334R8T6

mbed_f334r8_gcc_arm.build.architecture=arm-none-eabi
mbed_f334r8_gcc_arm.build.command.as=arm-none-eabi-as
mbed_f334r8_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_f334r8_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_f334r8_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_f334r8_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_f334r8_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_f334r8_gcc_arm.build.command.size=arm-none-eabi-size

mbed_f334r8_gcc_arm.build.core=mbed
mbed_f334r8_gcc_arm.build.variant=mbed_f334r8_gcc_arm

mbed_f334r8_gcc_arm.build.CC_FLAGS=  -mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=softfp -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections  -Wno-unused-function -Wno-unused-variable -MMD -MP  -DNDEBUG -Os
mbed_f334r8_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_f334r8_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_f334r8_gcc_arm.build.CC_SYMBOLS = -DTARGET_NUCLEO_F334R8 -DTARGET_M4 -DTARGET_STM -DTARGET_STM32F3 -DTARGET_STM32F334R8 -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M4 -DARM_MATH_CM4 -D__FPU_PRESENT=1 -DMBED_BUILD_TIMESTAMP=1414314040.05 -D__MBED__=1 -DTARGET_FF_ARDUINO -DTARGET_FF_MORPHO 
mbed_f334r8_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=softfp -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float -Wl,-Map={build.project_name}.map,--cref
mbed_f334r8_gcc_arm.build.LD_SYS_LIBS =   -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
mbed_f334r8_gcc_arm.build.ldscript=hw/mbed/variants/mbed_f334r8_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F3/TARGET_NUCLEO_F334R8/TOOLCHAIN_GCC_ARM/STM32F334x8.ld

mbed_f334r8_gcc_arm.build.use_archiver=false
mbed_f334r8_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f334r8_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f334r8_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_f334r8_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_f334r8_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_f334r8_gcc_arm/cmsis/TARGET_STM/TARGET_NUCLEO_f334r8/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_f334r8_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_f334r8_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_f334r8_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
###################################################################################################################
mbed_f302r8_gcc_arm.name=  ST Nucleo F302R8 mbed boards  by gcc_arm and upload by copy
mbed_f302r8_gcc_arm.upload.protocol=copy
mbed_f302r8_gcc_arm.upload.tool=mbed_cp
mbed_f302r8_gcc_arm.build.mcu=cortex-m4
mbed_f302r8_gcc_arm.build.cpu=STM32F302R8T6

mbed_f302r8_gcc_arm.build.architecture=arm-none-eabi
mbed_f302r8_gcc_arm.build.command.as=arm-none-eabi-as
mbed_f302r8_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_f302r8_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_f302r8_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_f302r8_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_f302r8_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_f302r8_gcc_arm.build.command.size=arm-none-eabi-size

mbed_f302r8_gcc_arm.build.core=mbed
mbed_f302r8_gcc_arm.build.variant=mbed_f302r8_gcc_arm

mbed_f302r8_gcc_arm.build.CC_FLAGS=  -mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=softfp -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections  -Wno-unused-function -Wno-unused-variable -MMD -MP  -DNDEBUG -Os
mbed_f302r8_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_f302r8_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_f302r8_gcc_arm.build.CC_SYMBOLS = -DTARGET_NUCLEO_F302R8 -DTARGET_M4 -DTARGET_CORTEX_M -DTARGET_STM -DTARGET_STM32F3 -DTARGET_STM32F302R8 -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M4 -DARM_MATH_CM4 -D__FPU_PRESENT=1 -DMBED_BUILD_TIMESTAMP=1423019726.34 -D__MBED__=1 -DTARGET_FF_ARDUINO -DTARGET_FF_MORPHO  
mbed_f302r8_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=softfp -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float -Wl,-Map={build.project_name}.map,--cref
mbed_f302r8_gcc_arm.build.LD_SYS_LIBS =   -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
mbed_f302r8_gcc_arm.build.ldscript=hw/mbed/variants/mbed_f302r8_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F3/TARGET_NUCLEO_F302R8/TOOLCHAIN_GCC_ARM/STM32F302X8.ld

mbed_f302r8_gcc_arm.build.use_archiver=false
mbed_f302r8_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f302r8_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f302r8_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_f302r8_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_f302r8_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_f302r8_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F3/TARGET_NUCLEO_F302R8/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_f302r8_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_f302r8_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_f302r8_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
###################################################################################################################
mbed_f303re_gcc_arm.name=  ST Nucleo F303RE mbed boards  by gcc_arm and upload by copy
mbed_f303re_gcc_arm.upload.protocol=copy
mbed_f303re_gcc_arm.upload.tool=mbed_cp
mbed_f303re_gcc_arm.build.mcu=cortex-m4
mbed_f303re_gcc_arm.build.cpu=STM32F303RET6 

mbed_f303re_gcc_arm.build.architecture=arm-none-eabi
mbed_f303re_gcc_arm.build.command.as=arm-none-eabi-as
mbed_f303re_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_f303re_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_f303re_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_f303re_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_f303re_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_f303re_gcc_arm.build.command.size=arm-none-eabi-size

mbed_f303re_gcc_arm.build.core=mbed
mbed_f303re_gcc_arm.build.variant=mbed_f303re_gcc_arm

mbed_f303re_gcc_arm.build.CC_FLAGS=  -mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=softfp -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections  -Wno-unused-function -Wno-unused-variable -MMD -MP  -DNDEBUG -Os
mbed_f303re_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_f303re_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_f303re_gcc_arm.build.CC_SYMBOLS = -DTARGET_NUCLEO_F303RE -DTARGET_M4 -DTARGET_CORTEX_M -DTARGET_STM -DTARGET_STM32F3 -DTARGET_STM32f303re -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M4 -DARM_MATH_CM4 -D__FPU_PRESENT=1 -DMBED_BUILD_TIMESTAMP=1423019726.34 -D__MBED__=1 -DTARGET_FF_ARDUINO -DTARGET_FF_MORPHO  
mbed_f303re_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=softfp -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float -Wl,-Map={build.project_name}.map,--cref
mbed_f303re_gcc_arm.build.LD_SYS_LIBS =   -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
mbed_f303re_gcc_arm.build.ldscript=hw/mbed/variants/mbed_f303re_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F3/TARGET_NUCLEO_f303re/TOOLCHAIN_GCC_ARM/STM32F303XE.ld

mbed_f303re_gcc_arm.build.use_archiver=false
mbed_f303re_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f303re_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f303re_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_f303re_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_f303re_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_f303re_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F3/TARGET_NUCLEO_f303re/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_f303re_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_f303re_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_f303re_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
###################################################################################################################
mbed_f303k8_gcc_arm.name=  ST Nucleo F303K8 mbed boards  by gcc_arm and upload by copy
mbed_f303k8_gcc_arm.upload.protocol=copy
mbed_f303k8_gcc_arm.upload.tool=mbed_cp
mbed_f303k8_gcc_arm.build.mcu=cortex-m4
mbed_f303k8_gcc_arm.build.cpu=STM32F303K8T6

mbed_f303k8_gcc_arm.build.architecture=arm-none-eabi
mbed_f303k8_gcc_arm.build.command.as=arm-none-eabi-as
mbed_f303k8_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_f303k8_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_f303k8_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_f303k8_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_f303k8_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_f303k8_gcc_arm.build.command.size=arm-none-eabi-size

mbed_f303k8_gcc_arm.build.core=mbed
mbed_f303k8_gcc_arm.build.variant=mbed_f303k8_gcc_arm

