mixly/SMeshStudio/mcore/hw/mbed/boards.txt
mbed_f072rb_gcc_arm.build.use_archiver=false
mbed_f072rb_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f072rb_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f072rb_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_f072rb_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_f072rb_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_f072rb_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F0/TARGET_NUCLEO_F072RB/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_f072rb_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_f072rb_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_f072rb_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
###################################################################################################################
mbed_f042k6_gcc_arm.name=ST Nucleo F042K6 mbed boards  by gcc_arm and upload by copy
mbed_f042k6_gcc_arm.upload.protocol=copy
mbed_f042k6_gcc_arm.upload.tool=mbed_cp
mbed_f042k6_gcc_arm.build.mcu=cortex-m0
mbed_f042k6_gcc_arm.build.cpu=STM32f042k6T6    

mbed_f042k6_gcc_arm.build.architecture=arm-none-eabi
mbed_f042k6_gcc_arm.build.command.as=arm-none-eabi-as
mbed_f042k6_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_f042k6_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_f042k6_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_f042k6_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_f042k6_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_f042k6_gcc_arm.build.command.size=arm-none-eabi-size

mbed_f042k6_gcc_arm.build.core=mbed
mbed_f042k6_gcc_arm.build.variant=mbed_f042k6_gcc_arm

mbed_f042k6_gcc_arm.build.CC_FLAGS=  -mcpu=cortex-m0 -mthumb  -c -g -fno-common -fmessage-length=0 -Wall -Wextra -fno-exceptions -ffunction-sections -fdata-sections -fomit-frame-pointer -MMD -MP -DNDEBUG -Os
mbed_f042k6_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_f042k6_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_f042k6_gcc_arm.build.CC_SYMBOLS = -D__CORTEX_M0 -DTARGET_FF_ARDUINO -DTOOLCHAIN_GCC_ARM -DTARGET_NUCLEO_F042K6 -DMBED_BUILD_TIMESTAMP=1448618223.08 -DTARGET_CORTEX_M -DARM_MATH_CM0 -D__MBED__=1 -DTARGET_STM -DTARGET_STM32F0 -DTARGET_M0 -DTOOLCHAIN_GCC -DTARGET_STM32F042K6  
mbed_f042k6_gcc_arm.build.LD_FLAGS = -mcpu=cortex-m0 -mthumb  -Wl,--gc-sections --specs=nano.specs -Wl,--wrap,main -Wl,-Map={build.project_name}.map,--cref
mbed_f042k6_gcc_arm.build.LD_SYS_LIBS =-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
mbed_f042k6_gcc_arm.build.ldscript=hw/mbed/variants/mbed_f042k6_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F0/TARGET_NUCLEO_f042k6/TOOLCHAIN_GCC_ARM/STM32F042X6.ld

mbed_f042k6_gcc_arm.build.use_archiver=false
mbed_f042k6_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f042k6_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f042k6_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_f042k6_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_f042k6_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_f042k6_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F0/TARGET_NUCLEO_f042k6/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_f042k6_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_f042k6_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_f042k6_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
###################################################################################################################
mbed_f091rc_gcc_arm.name=ST Nucleo F091RC mbed boards  by gcc_arm and upload by copy
mbed_f091rc_gcc_arm.upload.protocol=copy
mbed_f091rc_gcc_arm.upload.tool=mbed_cp
mbed_f091rc_gcc_arm.build.mcu=cortex-m0
mbed_f091rc_gcc_arm.build.cpu=STM32F042K6T6    

mbed_f091rc_gcc_arm.build.architecture=arm-none-eabi
mbed_f091rc_gcc_arm.build.command.as=arm-none-eabi-as
mbed_f091rc_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_f091rc_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_f091rc_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_f091rc_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_f091rc_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_f091rc_gcc_arm.build.command.size=arm-none-eabi-size

