mixly/SMeshStudio/mcore/hw/mbed/boards.txt
###################################################################################################################
mbed_efm32wg-stk3800_gcc_arm.name=Silicon mbed EFM32WG-STK3800 make by gcc_arm and upload by copy
mbed_efm32wg-stk3800_gcc_arm.upload.protocol=copy
mbed_efm32wg-stk3800_gcc_arm.upload.tool=mbed_cp
mbed_efm32wg-stk3800_gcc_arm.build.mcu=cortex-m4
mbed_efm32wg-stk3800_gcc_arm.build.cpu=EFM32WG990F256

mbed_efm32wg-stk3800_gcc_arm.build.architecture=arm-none-eabi
mbed_efm32wg-stk3800_gcc_arm.build.command.as=arm-none-eabi-as
mbed_efm32wg-stk3800_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_efm32wg-stk3800_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_efm32wg-stk3800_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_efm32wg-stk3800_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_efm32wg-stk3800_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_efm32wg-stk3800_gcc_arm.build.command.size=arm-none-eabi-size

mbed_efm32wg-stk3800_gcc_arm.build.core=mbed
mbed_efm32wg-stk3800_gcc_arm.build.variant=mbed_efm32wg-stk3800_gcc_arm

mbed_efm32wg-stk3800_gcc_arm.build.CC_FLAGS= -mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=hard -c -g -fno-common -fmessage-length=0 -Wall -Wextra -fno-exceptions -ffunction-sections -fdata-sections -fomit-frame-pointer  -MMD -MP  -DNDEBUG -Os
mbed_efm32wg-stk3800_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_efm32wg-stk3800_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_efm32wg-stk3800_gcc_arm.build.CC_SYMBOLS = -DMBED_BUILD_TIMESTAMP=1448612272.88 -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -DTARGET_CORTEX_M -DTARGET_Silicon_Labs -D__FPU_PRESENT=1 -D__MBED__=1 -DTARGET_M4 -DEFM32WG990F256 -DTARGET_EFM32 -D__CORTEX_M4 -DARM_MATH_CM4 -DTARGET_EFM32WG_STK3800   
mbed_efm32wg-stk3800_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=hard  -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float -Wl,--wrap,main -Wl,-Map=$(OBJ_FOLDER)$(PROJECT).map,--cref
mbed_efm32wg-stk3800_gcc_arm.build.LD_SYS_LIBS = -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys

mbed_efm32wg-stk3800_gcc_arm.build.ldscript=hw/mbed/variants/mbed_efm32wg-stk3800_gcc_arm/cmsis/TARGET_EFM32/TARGET_EFM32WG_STK3800/TOOLCHAIN_GCC_ARM/efm32wg.ld

mbed_efm32wg-stk3800_gcc_arm.build.use_archiver=false
mbed_efm32wg-stk3800_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_efm32wg-stk3800_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_efm32wg-stk3800_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_efm32wg-stk3800_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_efm32wg-stk3800_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_efm32wg-stk3800_gcc_arm/cmsis/TARGET_EFM32/TARGET_EFM32WG_STK3800/TOOLCHAIN_GCC_ARM/" {build.LD_SYS_LIBS}
mbed_efm32wg-stk3800_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_efm32wg-stk3800_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_efm32wg-stk3800_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
###################################################################################################################
mbed_efm32gg-stk3700_gcc_arm.name=Silicon mbed EFM32GG-STK3700 make by gcc_arm and upload by copy
mbed_efm32gg-stk3700_gcc_arm.upload.protocol=copy
mbed_efm32gg-stk3700_gcc_arm.upload.tool=mbed_cp
mbed_efm32gg-stk3700_gcc_arm.build.mcu=cortex-m3
mbed_efm32gg-stk3700_gcc_arm.build.cpu=EFM32GG990F1024

mbed_efm32gg-stk3700_gcc_arm.build.architecture=arm-none-eabi
mbed_efm32gg-stk3700_gcc_arm.build.command.as=arm-none-eabi-as
mbed_efm32gg-stk3700_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_efm32gg-stk3700_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_efm32gg-stk3700_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_efm32gg-stk3700_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_efm32gg-stk3700_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_efm32gg-stk3700_gcc_arm.build.command.size=arm-none-eabi-size

mbed_efm32gg-stk3700_gcc_arm.build.core=mbed
mbed_efm32gg-stk3700_gcc_arm.build.variant=mbed_efm32gg-stk3700_gcc_arm

mbed_efm32gg-stk3700_gcc_arm.build.CC_FLAGS=-mcpu=cortex-m3 -mthumb -c -g -fno-common -fmessage-length=0 -Wall -Wextra -fno-exceptions -ffunction-sections -fdata-sections -fomit-frame-pointer -MMD -MP -DNDEBUG -Os
mbed_efm32gg-stk3700_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_efm32gg-stk3700_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_efm32gg-stk3700_gcc_arm.build.CC_SYMBOLS =-DEFM32GG990F1024 -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -DTARGET_CORTEX_M -DTARGET_Silicon_Labs -DARM_MATH_CM3 -DTARGET_EFM32 -D__CORTEX_M3 -DTARGET_M3 -DTARGET_EFM32GG_STK3700 -DMBED_BUILD_TIMESTAMP=1448612850.49 -D__MBED__=1 
mbed_efm32gg-stk3700_gcc_arm.build.LD_FLAGS = -mcpu=cortex-m3 -mthumb  -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float -Wl,--wrap,main -Wl,-Map={build.project_name}.map,--cref
mbed_efm32gg-stk3700_gcc_arm.build.LD_SYS_LIBS = -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
mbed_efm32gg-stk3700_gcc_arm.build.ldscript=hw/mbed/variants/mbed_efm32gg-stk3700_gcc_arm/cmsis/TARGET_EFM32/TARGET_EFM32GG_STK3700/TOOLCHAIN_GCC_ARM/efm32gg.ld

mbed_efm32gg-stk3700_gcc_arm.build.use_archiver=false
mbed_efm32gg-stk3700_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_efm32gg-stk3700_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_efm32gg-stk3700_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_efm32gg-stk3700_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_efm32gg-stk3700_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_efm32gg-stk3700_gcc_arm/cmsis/TARGET_EFM32/TARGET_EFM32GG_STK3700/TOOLCHAIN_GCC_ARM/" {build.LD_SYS_LIBS}
mbed_efm32gg-stk3700_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_efm32gg-stk3700_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_efm32gg-stk3700_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
###################################################################################################################
mbed_efm32lg-stk3600_gcc_arm.name=Silicon mbed EFM32LG-STK3600 make by gcc_arm and upload by copy
mbed_efm32lg-stk3600_gcc_arm.upload.protocol=copy
mbed_efm32lg-stk3600_gcc_arm.upload.tool=mbed_cp
mbed_efm32lg-stk3600_gcc_arm.build.mcu=cortex-m3
mbed_efm32lg-stk3600_gcc_arm.build.cpu=EFM32LG990F256

mbed_efm32lg-stk3600_gcc_arm.build.architecture=arm-none-eabi
mbed_efm32lg-stk3600_gcc_arm.build.command.as=arm-none-eabi-as
mbed_efm32lg-stk3600_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_efm32lg-stk3600_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_efm32lg-stk3600_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_efm32lg-stk3600_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_efm32lg-stk3600_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_efm32lg-stk3600_gcc_arm.build.command.size=arm-none-eabi-size

mbed_efm32lg-stk3600_gcc_arm.build.core=mbed
mbed_efm32lg-stk3600_gcc_arm.build.variant=mbed_efm32lg-stk3600_gcc_arm

mbed_efm32lg-stk3600_gcc_arm.build.CC_FLAGS=-mcpu=cortex-m3 -mthumb -c -g -fno-common -fmessage-length=0 -Wall -Wextra -fno-exceptions -ffunction-sections -fdata-sections -fomit-frame-pointer -MMD -MP -DNDEBUG -Os
mbed_efm32lg-stk3600_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_efm32lg-stk3600_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_efm32lg-stk3600_gcc_arm.build.CC_SYMBOLS = -DTOOLCHAIN_GCC_ARM -DTARGET_EFM32LG_STK3600 -DMBED_BUILD_TIMESTAMP=1448613467.52 -DTARGET_CORTEX_M -DTARGET_Silicon_Labs -DARM_MATH_CM3 -DTARGET_EFM32 -D__CORTEX_M3 -DTARGET_M3 -DTOOLCHAIN_GCC -DEFM32LG990F256 -D__MBED__=1 
mbed_efm32lg-stk3600_gcc_arm.build.LD_FLAGS = -mcpu=cortex-m3 -mthumb -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float -Wl,--wrap,main -Wl,-Map={build.project_name}.map,--cref
mbed_efm32lg-stk3600_gcc_arm.build.LD_SYS_LIBS = -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
mbed_efm32lg-stk3600_gcc_arm.build.ldscript=hw/mbed/variants/mbed_efm32lg-stk3600_gcc_arm/cmsis/TARGET_EFM32/TARGET_EFM32LG_STK3600/TOOLCHAIN_GCC_ARM/efm32lg.ld

