mixly/SMeshStudio/mcore/hw/mbed/boards.txt
mbed_efm32lg-stk3600_gcc_arm.build.use_archiver=false
mbed_efm32lg-stk3600_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_efm32lg-stk3600_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_efm32lg-stk3600_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_efm32lg-stk3600_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_efm32lg-stk3600_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_efm32lg-stk3600_gcc_arm/cmsis/TARGET_EFM32/TARGET_EFM32LG_STK3600/TOOLCHAIN_GCC_ARM/" {build.LD_SYS_LIBS}
mbed_efm32lg-stk3600_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_efm32lg-stk3600_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_efm32lg-stk3600_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
###################################################################################################################
mbed_efm32zg-stk3200_gcc_arm.name=Silicon mbed EFM32ZG-STK3200 make by gcc_arm and upload by copy
mbed_efm32zg-stk3200_gcc_arm.upload.protocol=copy
mbed_efm32zg-stk3200_gcc_arm.upload.tool=mbed_cp
mbed_efm32zg-stk3200_gcc_arm.build.mcu=cortex-m0plus
mbed_efm32zg-stk3200_gcc_arm.build.cpu=EFM32ZG222F32

mbed_efm32zg-stk3200_gcc_arm.build.architecture=arm-none-eabi
mbed_efm32zg-stk3200_gcc_arm.build.command.as=arm-none-eabi-as
mbed_efm32zg-stk3200_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_efm32zg-stk3200_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_efm32zg-stk3200_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_efm32zg-stk3200_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_efm32zg-stk3200_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_efm32zg-stk3200_gcc_arm.build.command.size=arm-none-eabi-size

mbed_efm32zg-stk3200_gcc_arm.build.core=mbed
mbed_efm32zg-stk3200_gcc_arm.build.variant=mbed_efm32zg-stk3200_gcc_arm

mbed_efm32zg-stk3200_gcc_arm.build.CC_FLAGS=-mcpu=cortex-m0plus  -mthumb -c -g -fno-common -fmessage-length=0 -Wall -Wextra -fno-exceptions -ffunction-sections -fdata-sections -fomit-frame-pointer -MMD -MP -DNDEBUG -Os
mbed_efm32zg-stk3200_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_efm32zg-stk3200_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_efm32zg-stk3200_gcc_arm.build.CC_SYMBOLS =-DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -DEFM32ZG222F32 -DTARGET_CORTEX_M -DTARGET_Silicon_Labs -DMBED_BUILD_TIMESTAMP=1448613655.1 -DTARGET_M0P -DTARGET_EFM32 -DARM_MATH_CM0PLUS -D__CORTEX_M0PLUS -D__MBED__=1 -DTARGET_EFM32ZG_STK3200  
mbed_efm32zg-stk3200_gcc_arm.build.LD_FLAGS = -mcpu=cortex-m0plus -mthumb -Wl,--gc-sections --specs=nano.specs -Wl,--wrap,main -Wl,-Map={build.project_name}.map,--cref
mbed_efm32zg-stk3200_gcc_arm.build.LD_SYS_LIBS = -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
mbed_efm32zg-stk3200_gcc_arm.build.ldscript=hw/mbed/variants/mbed_efm32zg-stk3200_gcc_arm/cmsis/TARGET_EFM32/TARGET_EFM32ZG_STK3200/TOOLCHAIN_GCC_ARM/efm32zg.ld

mbed_efm32zg-stk3200_gcc_arm.build.use_archiver=false
mbed_efm32zg-stk3200_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_efm32zg-stk3200_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_efm32zg-stk3200_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_efm32zg-stk3200_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_efm32zg-stk3200_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_efm32zg-stk3200_gcc_arm/cmsis/TARGET_EFM32/TARGET_EFM32ZG_STK3200/TOOLCHAIN_GCC_ARM/" {build.LD_SYS_LIBS}
mbed_efm32zg-stk3200_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_efm32zg-stk3200_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_efm32zg-stk3200_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
###################################################################################################################
mbed_efm32hg-stk3400_gcc_arm.name=Silicon mbed EFM32HG-STK3400 make by gcc_arm and upload by copy
mbed_efm32hg-stk3400_gcc_arm.upload.protocol=copy
mbed_efm32hg-stk3400_gcc_arm.upload.tool=mbed_cp
mbed_efm32hg-stk3400_gcc_arm.build.mcu=cortex-m0plus
mbed_efm32hg-stk3400_gcc_arm.build.cpu=EFM32HG322F64

mbed_efm32hg-stk3400_gcc_arm.build.architecture=arm-none-eabi
mbed_efm32hg-stk3400_gcc_arm.build.command.as=arm-none-eabi-as
mbed_efm32hg-stk3400_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_efm32hg-stk3400_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_efm32hg-stk3400_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_efm32hg-stk3400_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_efm32hg-stk3400_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_efm32hg-stk3400_gcc_arm.build.command.size=arm-none-eabi-size

mbed_efm32hg-stk3400_gcc_arm.build.core=mbed
mbed_efm32hg-stk3400_gcc_arm.build.variant=mbed_efm32hg-stk3400_gcc_arm

mbed_efm32hg-stk3400_gcc_arm.build.CC_FLAGS=-mcpu=cortex-m0plus  -mthumb -c -g -fno-common -fmessage-length=0 -Wall -Wextra -fno-exceptions -ffunction-sections -fdata-sections -fomit-frame-pointer -MMD -MP -DNDEBUG -Os
mbed_efm32hg-stk3400_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_efm32hg-stk3400_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_efm32hg-stk3400_gcc_arm.build.CC_SYMBOLS =-DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -DTARGET_CORTEX_M -DTARGET_Silicon_Labs -DMBED_BUILD_TIMESTAMP=1448614428.43 -DTARGET_M0P -DEFM32HG322F64 -DTARGET_EFM32 -D__CORTEX_M0PLUS -DTARGET_EFM32HG_STK3400 -D__MBED__=1 -DARM_MATH_CM0PLUS   
mbed_efm32hg-stk3400_gcc_arm.build.LD_FLAGS = -mcpu=cortex-m0plus -mthumb  -Wl,--gc-sections --specs=nano.specs -Wl,--wrap,main -Wl,-Map={build.project_name}.map,--cref
mbed_efm32hg-stk3400_gcc_arm.build.LD_SYS_LIBS = -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
mbed_efm32hg-stk3400_gcc_arm.build.ldscript=hw/mbed/variants/mbed_efm32hg-stk3400_gcc_arm/cmsis/TARGET_EFM32/TARGET_EFM32HG_STK3400/TOOLCHAIN_GCC_ARM/efm32hg.ld

mbed_efm32hg-stk3400_gcc_arm.build.use_archiver=false
mbed_efm32hg-stk3400_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_efm32hg-stk3400_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_efm32hg-stk3400_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_efm32hg-stk3400_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_efm32hg-stk3400_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_efm32hg-stk3400_gcc_arm/cmsis/TARGET_EFM32/TARGET_EFM32HG_STK3400/TOOLCHAIN_GCC_ARM/" {build.LD_SYS_LIBS}
mbed_efm32hg-stk3400_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_efm32hg-stk3400_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_efm32hg-stk3400_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
